In [1]:
import pandas as pd

In [2]:
#Q1. List any five functions of the pandas library with execution.
#1.read_csv(): to read the data from a csv file.
df = pd.read_csv("services.csv")

In [3]:
#2.head(): shows the first five rows of a dataframe
df.head()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN

In [4]:
#3.describe(): gives the description of the dataframe ehich includes mean, standard deviation, minimum, maximum etc.
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [5]:
#4.loc: loc allows us to extract portion of the dataframe
df.loc[2:5,['location_id','keywords']]

   location_id                                           keywords
2            3  Geriatric Counseling, Older Adults, Gay, Lesbi...
3            4  INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...
4            5     COMMUNITY SERVICES, Speakers, Automobile Loans
5            6  ADULT PROTECTION AND CARE SERVICES, In-Home Su...

In [6]:
#5.dtypes(): gives the data types of the variables in each column
df.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [7]:
'''Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.
'''
data = {
    'A' : ['a','b','c'],
    'B' : [8,11,17],
    'C' : ['se','ml','ai']
}
df = pd.DataFrame(data)

In [8]:
df

   A   B   C
0  a   8  se
1  b  11  ml
2  c  17  ai

In [9]:
df.columns = [1,3,5]

In [10]:
df

   1   3   5
0  a   8  se
1  b  11  ml
2  c  17  ai

In [11]:
'''Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
'''
data = {
   'A':['a','b','c','d','e'],
    'values':[10,20,30,40,50]
}
df = pd.DataFrame(data)

In [12]:
df

   A  values
0  a      10
1  b      20
2  c      30
3  d      40
4  e      50

In [13]:
def sum_three(arr):
    sum=0
    for i in range(len(arr)):
        if i>2:
            pass
        else:
            sum+=arr[i]
    print(sum)

In [14]:
sum_three(df['values'])

60

In [15]:
'''Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.
'''
def count_word(string):
    l = []
    for text in string:
        count0=0
        for i in text:
            if(i==' '):
               count0+=1
        l.append(count0+1)
    return l

In [16]:
data = {
    'Text': ['data science is rising','artificial intelligence will revolutionize the world of science']
}
df = pd.DataFrame(data)

In [17]:
df

                                                Text
0                             data science is rising
1  artificial intelligence will revolutionize the...

In [18]:
df.dtypes

Text    object
dtype: object

In [19]:
count_word(df['Text'])

[4, 8]

In [20]:
df['Word_Count']=count_word(df['Text'])

In [21]:
df

                                                Text  Word_Count
0                             data science is rising           4
1  artificial intelligence will revolutionize the...           8

In [22]:
'''Q5. How are DataFrame.size() and DataFrame.shape() different?
-> DataFrame.size() gives the value of the number of rows times the number of columns while
DataFrame.shape() gives the values of the number of rows followed by the number of columns.
'''

'Q5. How are DataFrame.size() and DataFrame.shape() different?\n-> DataFrame.size() gives the value of the number of rows times the number of columns while\nDataFrame.shape() gives the values of the number of rows followed by the number of columns.\n'

In [23]:
'''Q6. Which function of pandas do we use to read an excel file?
-> read_excel() is used to read an excel file.
'''

'Q6. Which function of pandas do we use to read an excel file?\n-> read_excel() is used to read an excel file.\n'

In [24]:
'''Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
'''
def Username(email):
    l=[]
    for name in email:
        string = ""
        for i in name:
            if i=='@':
                break
            else:
                string = string+i
        l.append(string)
    return l

In [25]:
data = {
    'Email': ['john.doe@gmail.com','dsmz123@gmail.com','mswork.of@yahoo.com']
}
df = pd.DataFrame(data)

In [26]:
df

                 Email
0   john.doe@gmail.com
1    dsmz123@gmail.com
2  mswork.of@yahoo.com

In [27]:
df['Username']=Username(df['Email'])

In [28]:
df

                 Email   Username
0   john.doe@gmail.com   john.doe
1    dsmz123@gmail.com    dsmz123
2  mswork.of@yahoo.com  mswork.of

In [29]:
'''Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
'''
data = {
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
}
df = pd.DataFrame(data)

In [30]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [31]:
df2 = df[(df['A']>5)&(df['B']<10)]

In [32]:
df2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [33]:
'''Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.
'''
data = {
   'A':['a','b','c','d','e'],
    'Values':[10,20,30,40,50]
}
df = pd.DataFrame(data)

In [34]:
df

   A  Values
0  a      10
1  b      20
2  c      30
3  d      40
4  e      50

In [35]:
import numpy as np

In [36]:
np.mean(df['Values'])

30.0

In [37]:
np.median(df['Values'])

30.0

In [38]:
np.std(df['Values'])

14.142135623730951

In [39]:
'''Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.'''
data = {
    "Date": ["2016-09-01","2016-09-02","2016-09-06","2016-09-07","2016-09-08","2016-09-10","2016-09-11","2016-09-12",
          "2016-09-16","2016-09-17","2016-09-20","2016-09-21","2016-09-22","2016-09-26","2016-09-28"],
    "Sales": [509.767914, 501.917328,505.161560,504.047150,511.848175,535.546783,585.919896,611.786959,501.758475,497.734799,645.785478,653.743749,648.754837,672.758748,655.822179]
}
df = pd.DataFrame(data)

In [40]:
df

          Date       Sales
0   2016-09-01  509.767914
1   2016-09-02  501.917328
2   2016-09-06  505.161560
3   2016-09-07  504.047150
4   2016-09-08  511.848175
5   2016-09-10  535.546783
6   2016-09-11  585.919896
7   2016-09-12  611.786959
8   2016-09-16  501.758475
9   2016-09-17  497.734799
10  2016-09-20  645.785478
11  2016-09-21  653.743749
12  2016-09-22  648.754837
13  2016-09-26  672.758748
14  2016-09-28  655.822179

In [41]:
df['MovingAverage']=df['Sales'].rolling(7).mean()

In [42]:
df

          Date       Sales  MovingAverage
0   2016-09-01  509.767914            NaN
1   2016-09-02  501.917328            NaN
2   2016-09-06  505.161560            NaN
3   2016-09-07  504.047150            NaN
4   2016-09-08  511.848175            NaN
5   2016-09-10  535.546783            NaN
6   2016-09-11  585.919896     522.029829
7   2016-09-12  611.786959     536.603979
8   2016-09-16  501.758475     536.581285
9   2016-09-17  497.734799     535.520320
10  2016-09-20  645.785478     555.768652
11  2016-09-21  653.743749     576.039448
12  2016-09-22  648.754837     592.212028
13  2016-09-26  672.758748     604.617578
14  2016-09-28  655.822179     610.908324

In [44]:
'''Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
'''
from datetime import datetime

In [64]:
DATE=[]
for i in df['Date']:
    DATE.append(pd.to_datetime(i).day_name())

In [66]:
DATE

['Thursday',
 'Friday',
 'Tuesday',
 'Wednesday',
 'Thursday',
 'Saturday',
 'Sunday',
 'Monday',
 'Friday',
 'Saturday',
 'Tuesday',
 'Wednesday',
 'Thursday',
 'Monday',
 'Wednesday']

In [67]:
df["Weekday"]=DATE

In [68]:
df

          Date       Sales  MovingAverage    Weekday
0   2016-09-01  509.767914            NaN   Thursday
1   2016-09-02  501.917328            NaN     Friday
2   2016-09-06  505.161560            NaN    Tuesday
3   2016-09-07  504.047150            NaN  Wednesday
4   2016-09-08  511.848175            NaN   Thursday
5   2016-09-10  535.546783            NaN   Saturday
6   2016-09-11  585.919896     522.029829     Sunday
7   2016-09-12  611.786959     536.603979     Monday
8   2016-09-16  501.758475     536.581285     Friday
9   2016-09-17  497.734799     535.520320   Saturday
10  2016-09-20  645.785478     555.768652    Tuesday
11  2016-09-21  653.743749     576.039448  Wednesday
12  2016-09-22  648.754837     592.212028   Thursday
13  2016-09-26  672.758748     604.617578     Monday
14  2016-09-28  655.822179     610.908324  Wednesday

In [69]:
'''Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.'''
data = {
    "Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-02-01","2023-02-11"]
}

In [70]:
df = pd.DataFrame(data)

In [71]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-02-01
6  2023-02-11

In [73]:
df[(df["Date"]>="2023-01-01") & (df["Date"]<="2023-01-31")]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [74]:
'''Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
->> To use the basic functions of pandas the first and foremost library that needs to be imported is "pandas".
'''

'Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to\nbe imported?\n->> To use the basic functions of pandas the first and foremost library that needs to be imported is "pandas".\n'